


#토익 점수의 평균이 500, 표준 오차가 100

#90%일 때 z값 1.64

500 - 1.64*100

500 + 1.64*100


#신뢰도 90%에서의 평균에 대한 모수 구간 추정
# 336  <= μ  <= 664


#95%일 때 z값 1.96

500 - 1.96*100

500 + 1.96*100

# 304  <= μ  <= 696

#99%일 때 z값 2.58


500 - 2.58*100

500 + 2.58*100

# 242  <= μ  <= 758


#유의 수준 5% (1-신뢰도)   : 신뢰도 95%

options(digits = 4)

x<-c(168,160,170,162,168,163,164,167,175,179,161,155)

length(x)
?dt

minus_t<-qt(0.025, df = length(x)-1)

?rnorm

         

#d          t(평균, 표본의 갯수가 30개 이하 )
#p    *     Chisq(분산 1개)
#q          f(분산 2개, 분산의 비)
#r          norm(평균, 표본의 갯수가 30개 이상 )



mean(x)+minus_t*1.9188     


mean(x)-minus_t*1.9188


qchisq(0.025, df= 49)


qchisq(1-0.025, df= 49)




49*2.5 / 70.22


49*2.5 / 31.55








?qnorm



qnorm(0.025, mean = 0, sd = 1)
qnorm(1-0.025, mean = 0, sd = 1)


pnorm(-1.96, mean = 0, sd = 1)

pnorm(1.96, mean = 0, sd = 1)


1-0.05

qnorm(0.05, mean = 0, sd = 1)
qnorm(1-0.05, mean = 0, sd = 1)










(244.65-300) / (20/sqrt(300))



qnorm(0.05, mean = 0, sd = 1)





x<-c(308,	302,	290,	292,	327,290,	320,	285,	315,	285,	295,	288,	310,	325,	300)


#귀무가설 : 300ml이다. 
#대립가설 : 300ml보다 작다.

mean(x)   

#302.1

sd(x)

length(x)

#t값 :  편차 / 표준 오차

(302.1 - 300) / (14.54 /sqrt(length(x)))

0.5594



#분산 모르고 표본 15개 -> t분포

?qt

#degrees of freedom : 자유도 

qt(0.05, df = length(x)-1)






#귀무가설 : 300ml이다. 
#대립가설 : 300ml보다 작다.
#z값

편차 / 표준오차

표준오차 : 표준편차/sqrt(n)



(294.65-300) /   (45/sqrt(300))

#z값
-2.059



?qnorm

qnorm(0.05, mean = 0, sd = 1)






#p-value



?pnorm



pnorm(-1.645, mean=0,sd=1)




pnorm(-2.059, mean=0,sd=1)



#

#귀무가설(H0)  : 80%이상이 서비스에 만족 

#대립가설(H1)   : 80%이상이 서비스에 만족하지 않는다.
#            즉 80*미만일 것이다.


#z값

#P0=80
#P_hat(샘플 비율)  : 100명중 81명의 고객이 만족(81%)


(0.81-0.80) / sqrt( 0.8*0.2  / 100 )



#기준 : 유의수준(0.05)에서의 z 값

qnorm(0.05, mean = 0,sd = 1)














?qchisq




#자동차 연비 평균 25km/l  분산 6.25

#표본 50개,  측정 결과  연비 평균 22.4, 분산 3.84

#귀무가설  분산 6.25이다.
#대립가설  분산 6.25가 아니다.



?qchisq

(49*3.84) / 6.26



#카이스퀘어 값 

qchisq(0.025, df = 50-1)
qchisq(0.975, df = 50-1)



qchisq(0.95, df = 50-1)










?qt



qt(0.025, df = 29)
qt(1-0.025, df = 29)


3.9 - (2.045*0.663)
3.9 + (2.045*0.663)

before<-c(75,	74,	75,	75,	83,	77,	82,	62,	77,	82,	72,	75,	78,	71,	68,	76,	71,	54,	75,	77,	82,	74,	76,	70,	77,	82,	62,	77,	82,	68)
after<-c(73,	74,	76,	71,	76,	68,	75,	61,	68,	75,	70,	71,	71,	70,	67,	73,	74,	50,	76,	68,	75,	74,	73,	69,	68,	75,	61,	68,	75,	67)

?t.test()


t.test(before, after, alternative = "two.sided", paired = TRUE)




#표본의 개수가 20개

#두 모집단의 분산이 동일할 때에는 두 모집단이 정규분포이거나 정규분포와 비슷하다는 가정이 있어야 검정을 할 수 있다.

#독립표본 t 검정



#귀무가설(H0) 제조사별 건전지의 사용 시간에 차이가 없다.
#대립가설(H1) 제조사별 건전지의 사용 시간에 차이가 있다.



A<-c(18,	16,	17,	15,	14,	19,	16,	15,	18,	15,	16,	17,	15,	14,	19,	12,	16,	18,	15,	17)


B<-c(16,	15,	16,	14,	15,	18,	13,	15,	12,	17,	15,	16,	18,	12,	14,	15,	16,	15,	15,	17)


var(A)

var(B)

#합동 분산 추정량

((20-1)*3.253 + (20-1)*2.8)  / (40-2)



#t값   1.636

(16.1-15.2) / (sqrt(3.026)*sqrt(2/20))


qt(0.025, df = 38)
qt(1-0.025, df = 38)




t.test(A,B, alternative = "two.sided", var.equal = TRUE)





options(digits = 3)

#공통비율을 이용한 가설 검정

(450*0.942 + 525*0.907) / 975


(0.942-0.907) /  sqrt(0.923*(1-0.923)*(1/450+1/525))


?qnorm()


qnorm(0.025)
qnorm(0.975)



prop<-c(0.942, 0.907)

n<-c(450,525)

x<-prop*n

x
prop.test(x=x, n=n, alternative = c("two.sided"))





?qf


qf(0.95, df1 = 3-1, df2 = 24-3)


?aov





A_conv<-data.frame(c(1,4,3,3,3,3,3,0,0), c(1,1,1,1,1,1,1,1,1))
B_conv<-data.frame(c(4,	4,	3,	4,	4,	5,	4,	4,0), c(2,2,2,2,2,2,2,2,2))
C_conv<-data.frame(c(4,3,4,3,4,4,3,3,3), c(3,3,3,3,3,3,3,3,3))




df_anova<-data.frame(A=A_conv, B=B_conv,C=C_conv)
colnames(df_anova)<-c('만족도','그룹', '만족도','그룹', '만족도', '그룹')
df_anova


a<-df_anova[ , c(1,2)]
b<-df_anova[ , c(3,4)]
c<-df_anova[ , c(5,6)]

c

ab<-rbind(a,b)


abc<-rbind(ab,c)


abc



df_final<-abc[-c(8,9,18), ]


df_final

str(df_final)

boxplot(df_final$만족도  ~ df_final$그룹)


aov(만족도  ~ 그룹, data=df_final)

summary(aov(만족도  ~ 그룹, data=df_final))










